{"config": [{"config": {"function_type": "lambda", "name": "lambda_1", "input_dtype": "float32", "output_shape_type": "raw", "arguments": {}, "batch_input_shape": [null, 16, 32, 1], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa'/home/prasad/udacity/simulator/utils.py\u00da\b<lambda>\u009f\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "trainable": true}, "class_name": "Lambda"}, {"config": {"init": "glorot_uniform", "name": "convolution2d_1", "dim_ordering": "tf", "nb_row": 3, "nb_col": 3, "batch_input_shape": [null, 16, 32, 1], "subsample": [1, 1], "trainable": true, "b_constraint": null, "b_regularizer": null, "nb_filter": 16, "input_dtype": "float32", "W_regularizer": null, "border_mode": "valid", "W_constraint": null, "activation": "relu", "activity_regularizer": null, "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_1", "dim_ordering": "tf", "border_mode": "valid", "strides": [4, 4], "pool_size": [4, 4], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "name": "dense_1", "bias": true, "activity_regularizer": null, "trainable": true, "b_constraint": null, "output_dim": 1, "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "input_dim": 336, "activation": "tanh"}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}