{"config": [{"config": {"trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa'/home/prasad/udacity/simulator/utils.py\u00da\b<lambda>\u009f\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "output_shape_type": "raw", "name": "lambda_1", "arguments": {}, "output_shape": null, "function_type": "lambda", "batch_input_shape": [null, 16, 32, 1]}, "class_name": "Lambda"}, {"config": {"W_regularizer": null, "activity_regularizer": null, "subsample": [1, 1], "nb_col": 3, "b_regularizer": null, "W_constraint": null, "activation": "relu", "dim_ordering": "tf", "nb_filter": 16, "batch_input_shape": [null, 16, 32, 1], "input_dtype": "float32", "init": "glorot_uniform", "border_mode": "valid", "nb_row": 3, "b_constraint": null, "bias": true, "trainable": true, "name": "convolution2d_1"}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "strides": [4, 4], "dim_ordering": "tf", "pool_size": [4, 4], "trainable": true, "name": "maxpooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "activation": "tanh", "init": "glorot_uniform", "b_constraint": null, "bias": true, "output_dim": 1, "input_dim": 336, "trainable": true, "name": "dense_1"}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}