{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "arguments": {}, "trainable": true, "output_shape_type": "raw", "batch_input_shape": [null, 16, 32, 1], "function_type": "lambda", "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa&/home/carnd/simulator/project/utils.py\u00da\b<lambda>\u00f8\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "init": "glorot_uniform", "trainable": true, "batch_input_shape": [null, 16, 32, 1], "border_mode": "valid", "nb_row": 3, "b_constraint": null, "W_regularizer": null, "nb_filter": 16, "dim_ordering": "tf", "bias": true, "nb_col": 3, "activation": "relu", "b_regularizer": null, "subsample": [1, 1], "activity_regularizer": null, "W_constraint": null, "input_dtype": "float32"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "border_mode": "valid", "trainable": true, "pool_size": [4, 4], "dim_ordering": "tf", "strides": [4, 4]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "init": "glorot_uniform", "trainable": true, "output_dim": 1, "b_constraint": null, "input_dim": null, "W_regularizer": null, "bias": true, "activation": "tanh", "b_regularizer": null, "activity_regularizer": null, "W_constraint": null}}], "keras_version": "1.1.2"}